# Spaces Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..Spaces Property
Zone Class See Also
---
Get the Spaces of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpaceSet Spaces { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Spaces As SpaceSet
	Get
```

Visual C++
---
```text
public:
property SpaceSet^ Spaces {
	SpaceSet^ get ();
}
```

# Remarks
This property is used to get the Spaces of the Zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace